//TODO:引例:二分查找

//TODO:POJ 1226 Substrings 字符串排序按排序结果处理  string::find()!=string::npos
//http://poj.org/problem?id=1226
/*
#include<iostream>
#include<vector>
#include<algorithm>
#include<string>
using namespace std;
#define N 105
int n;
vector<string> V;
bool cmp(string s1,string s2)
{
    return s1.length()<s2.length();
}
int main()
{
    ios::sync_with_stdio(false);
    int t;cin>>t;
    string str;
    while(t--)
    {
        cin>>n;
        V.clear();
        for(int i=0;i<n;i++)
        {
            cin>>str;V.push_back(str);
        }
        sort(V.begin(),V.end(),cmp);
        if(n==1)
        {
            cout<<V[0].length()<<endl;
            continue;
        }
        int ans=0;
        bool finish=false;
        for(int len=V[0].length();len>0;len--)//子串长度
        {
            if(finish) break;
            for(int i=0;i<=(V[0].length()-len);i++)//起点
            {
                string sub=V[0].substr(i,len);
                string resub=sub;
                reverse(resub.begin(),resub.end());
                bool flag=false;
                for(int k=1;k<n;k++)
                {
                    //或者以str&rts的形式处理
                    if(V[k].find(sub)!=string::npos||V[k].find(resub)!=string::npos)
                    {
                        flag=true;
                    }
                    else
                    {
                        flag=false;
                        break;
                    }
                }
                if(flag) 

                {
                    ans.push_back(ei);
                    vis_for_e[ei]=1;
                }
            }
        }
    }
}
int main()
{
    ios::sync_with_stdio(false);
    while(cin>>n>>k>>d)
    {
        while(!Q.empty()) Q.pop();//init
        memset(vis_for_v,0,sizeof(vis_for_v));
        memset(belong,0,sizeof(belong));
        memset(vis_for_e,0,sizeof(vis_for_e));
        for(int i=1;i<=n;i++) G[i].clear();
        int ps;
        for(int i=1;i<=k;i++)
        {
            cin>>ps;
            Q.push(ps);
            vis_for_v[ps]=1;
            belong[ps]=ps;
        }
        int u,v;
        for(int i=1;i<=n-1;i++)
        {
            cin>>u>>v;
            G[u].push_back(make_pair(v,i));
            G[v].push_back(make_pair(u,i));
        }
        ans.clear();
        BFS();
        cout<<ans.size()<<endl;
        for(int i=0;i<ans.size();i++)
        {
            if(i!=ans.size()-1) cout<<ans[i]<<" ";
            else cout<<ans[i]<<endl;
        }
    }
}
*/

//TODO:Nim博弈 能从某一状态到P状态则该状态为N状态 从某一状态的后继状态都为N状态则该状态为P状态
//http://codeforces.com/gym/101246/problem/D
/*
#include<iostream>
#include<cstring>
#include<vector>
#include<stack>
#include<queue>
using namespace std;
#define N 1010
vector<int> G[N];
queue<int>  Q;
int n,m;
bool vis[N];
bool status[N];
int dis[N];
stack<int> S;//BFS反序
void BFS(int start)
{
    while(!Q.empty())   Q.pop();
    while(!S.empty())   S.pop();
    memset(vis,0,sizeof(vis));
    Q.push(start);
    S.push(start);
    dis[start]=0;
    vis[start]=1;
    while(!Q.empty())
    {
        int now=Q.front();
        Q.pop();
        for(auto next:G[now])
        {
            if(!vis[next])//未访问
            {
                dis[next]=dis[now]+1;
                vis[next]=1;
                Q.push(next);
                S.push(next);
            }//已访问不处理
        }
    }
    memset(status,0,sizeof(status));
    while(!S.empty())
    {
        int now=S.top();
        S.pop();
        for(auto ele:G[now])
        {
            if(dis[now]==dis[ele]+1&&status[now]==0) 
                status[ele]=1;//注意这里NP点的判断  WA:判断太复杂 其实只有01两种情况
        }
        //cout<<"now:"<<now<<"    dis:"<<dis[now]<<" status:"<<status[now]<<endl;
    }
}
int main()
{
    ios::sync_with_stdio(false);
    
    freopen("input.txt","r",stdin);
    freopen("output.txt","w",stdout);
    
    while(cin>>n>>m)
    {
        for(int i=1;i<=n;i++) G[i].clear();
        int a,b;
        for(int i=1;i<=m;i++)
        {
            cin>>a>>b;
            G[a].push_back(b);
            G[b].push_back(a);
        }
        BFS(1);
        if(status[1]) cout<<"Vladimir"<<endl;
        else cout<<"Nikolay"<<endl;
    }
}
*/

//TODO:https://codeforces.com/contest/676/problem/D
//TODO:五种状态 4个方向+旋转 旋转次数不可以为全局变量 应与每个状态相关
/*
#include <iostream>
#include <cstring>
#include <queue>
using namespace std;
#define N 1010
//用二进制表示门 0-15共16种状态 判断是否有门 &  位右移来表示旋转
char ch;
int n, m;
int maze[N][N];
int vis[N][N][5]; //不超过四次？
int stx, sty;
int edx, edy;
struct node
{
    int x;
    int y;
    int rots;
    int len;
    node() : rots(0), len(0){};
    node(int r, int c, int l, int t) : x(r), y(c), len(l), rots(t){};
};
int trans(char ch) //上右下左
{
    switch (ch)
    {
    case '+':
        return 15; //1111
    case '-':
        return 5; //0101
    case '*':
        return 0; //0000
    case '^':
        return 8; //1000
    case 'v':
        return 2; //0010
    case '<':
        return 1; //0001
    case '>':
        return 4; //0100
    case '|':
        return 10; //1010
    case 'L':
        return 14; //1110 与0001&
    case 'R':
        return 11; //1011 与0100&
    case 'U':
        return 7; //0111  与1000&
    case 'D':
        return 13; //1101 与0010&
        //这里共12种状态
    }
}
int dir[4][2] = {{0, -1}, {1, 0}, {0, 1}, {-1, 0}}; //左下右上
bool legal(int r, int c)
{
    if (r < 1 || r > n)
        return false;
    if (c < 1 || c > m)
        return false;
    return true;
}
int BFS()
{
    int ans = -1;
    queue<node> Q;
    Q.push(node(stx, sty, 0, 0));
    memset(vis, 0, sizeof(vis));
    vis[stx][sty][0] = 1; //未选择下已访问
    while (!Q.empty())
    {
        node now = Q.front();
        Q.pop();
        //cout << "r:" << now.x << " c:" << now.y << "  rot:" << now.rots << " len: " << now.len << endl;
        if (now.x == edx && now.y == edy)
        {
            ans = now.len;
            return ans;
        }
        for (int i = 0; i < 4; i++) //当前方向 i 对应方向(i+2)%4
        {
            int dx = now.x + dir[i][0];
